; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem BW-rand-12)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 )
(:init
(arm-empty)
(on b1 b8)
(on b2 b12)
(on b3 b5)
(on b4 b9)
(on b5 b6)
(on b6 b10)
(on-table b7)
(on b8 b4)
(on b9 b11)
(on b10 b7)
(on b11 b3)
(on b12 b1)
(clear b2)
)
(:goal
(and
(on b3 b1)
(on b4 b3)
(on b5 b4)
(on b6 b10)
(on b9 b11)
(on b10 b7)
(on b11 b8)
(on b12 b5))
)
)

; plan
1. (unstack b2 b12)
   deleted: (on b2 b12) (clear b2) (arm-empty)
   added: (holding b2) (clear b12)
   goals met: 3 of 8
2. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 3 of 8
3. (unstack b12 b1)
   deleted: (on b12 b1) (clear b12) (arm-empty)
   added: (holding b12) (clear b1)
   goals met: 3 of 8
4. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 3 of 8
5. (unstack b1 b8)
   deleted: (on b1 b8) (clear b1) (arm-empty)
   added: (holding b1) (clear b8)
   goals met: 3 of 8
6. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 3 of 8
7. (unstack b8 b4)
   deleted: (on b8 b4) (clear b8) (arm-empty)
   added: (holding b8) (clear b4)
   goals met: 3 of 8
8. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 3 of 8
9. (unstack b4 b9)
   deleted: (on b4 b9) (clear b4) (arm-empty)
   added: (holding b4) (clear b9)
   goals met: 3 of 8
10. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 3 of 8
11. (unstack b9 b11)
   deleted: (on b9 b11) (clear b9) (arm-empty)
   added: (holding b9) (clear b11)
   goals met: 2 of 8
12. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 2 of 8
13. (unstack b11 b3)
   deleted: (on b11 b3) (clear b11) (arm-empty)
   added: (holding b11) (clear b3)
   goals met: 2 of 8
14. (stack b11 b8)
   deleted: (clear b8) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b8)
   goals met: 3 of 8
15. (unstack b3 b5)
   deleted: (on b3 b5) (clear b3) (arm-empty)
   added: (holding b3) (clear b5)
   goals met: 3 of 8
16. (stack b3 b1)
   deleted: (clear b1) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b1)
   goals met: 4 of 8
17. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 4 of 8
18. (stack b4 b3)
   deleted: (clear b3) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b3)
   goals met: 5 of 8
19. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 5 of 8
20. (stack b9 b11)
   deleted: (clear b11) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b11)
   goals met: 6 of 8
21. (unstack b5 b6)
   deleted: (on b5 b6) (clear b5) (arm-empty)
   added: (holding b5) (clear b6)
   goals met: 6 of 8
22. (stack b5 b4)
   deleted: (clear b4) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b4)
   goals met: 7 of 8
23. (pickup b12)
   deleted: (clear b12) (on-table b12) (arm-empty)
   added: (holding b12)
   goals met: 7 of 8
24. (stack b12 b5)
   deleted: (clear b5) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b5)
   goals met: 8 of 8
